SushiBits/platform-stm32f1/include/stm32f100xe_handler.h
/* This file is auto-generated using the IRQN tool. Do not modify. */

#ifndef IRQN_HANDLER

#include <stm32f1xx_it.h>

#else

IRQN_HANDLER(-14, NonMaskableInt_IRQn)
IRQN_HANDLER(-13, HardFault_IRQn)
IRQN_HANDLER(-12, MemoryManagement_IRQn)
IRQN_HANDLER(-11, BusFault_IRQn)
IRQN_HANDLER(-10, UsageFault_IRQn)
SKIP_HANLDER(-9)
SKIP_HANLDER(-8)
SKIP_HANLDER(-7)
SKIP_HANLDER(-6)
IRQN_HANDLER(-5, SVCall_IRQn)
IRQN_HANDLER(-4, DebugMonitor_IRQn)
SKIP_HANLDER(-3)
IRQN_HANDLER(-2, PendSV_IRQn)
IRQN_HANDLER(-1, SysTick_IRQn)
IRQN_HANDLER(0, WWDG_IRQn)
IRQN_HANDLER(1, PVD_IRQn)
IRQN_HANDLER(2, TAMPER_IRQn)
IRQN_HANDLER(3, RTC_IRQn)
IRQN_HANDLER(4, FLASH_IRQn)
IRQN_HANDLER(5, RCC_IRQn)
IRQN_HANDLER(6, EXTI0_IRQn)
IRQN_HANDLER(7, EXTI1_IRQn)
IRQN_HANDLER(8, EXTI2_IRQn)
IRQN_HANDLER(9, EXTI3_IRQn)
IRQN_HANDLER(10, EXTI4_IRQn)
IRQN_HANDLER(11, DMA1_Channel1_IRQn)
IRQN_HANDLER(12, DMA1_Channel2_IRQn)
IRQN_HANDLER(13, DMA1_Channel3_IRQn)
IRQN_HANDLER(14, DMA1_Channel4_IRQn)
IRQN_HANDLER(15, DMA1_Channel5_IRQn)
IRQN_HANDLER(16, DMA1_Channel6_IRQn)
IRQN_HANDLER(17, DMA1_Channel7_IRQn)
IRQN_HANDLER(18, ADC1_IRQn)
SKIP_HANLDER(19)
SKIP_HANLDER(20)
SKIP_HANLDER(21)
SKIP_HANLDER(22)
IRQN_HANDLER(23, EXTI9_5_IRQn)
IRQN_HANDLER(24, TIM1_BRK_TIM15_IRQn)
IRQN_HANDLER(25, TIM1_UP_TIM16_IRQn)
IRQN_HANDLER(26, TIM1_TRG_COM_TIM17_IRQn)
IRQN_HANDLER(27, TIM1_CC_IRQn)
IRQN_HANDLER(28, TIM2_IRQn)
IRQN_HANDLER(29, TIM3_IRQn)
IRQN_HANDLER(30, TIM4_IRQn)
IRQN_HANDLER(31, I2C1_EV_IRQn)
IRQN_HANDLER(32, I2C1_ER_IRQn)
IRQN_HANDLER(33, I2C2_EV_IRQn)
IRQN_HANDLER(34, I2C2_ER_IRQn)
IRQN_HANDLER(35, SPI1_IRQn)
IRQN_HANDLER(36, SPI2_IRQn)
IRQN_HANDLER(37, USART1_IRQn)
IRQN_HANDLER(38, USART2_IRQn)
IRQN_HANDLER(39, USART3_IRQn)
IRQN_HANDLER(40, EXTI15_10_IRQn)
IRQN_HANDLER(41, RTC_Alarm_IRQn)
IRQN_HANDLER(42, CEC_IRQn)
IRQN_HANDLER(43, TIM12_IRQn)
IRQN_HANDLER(44, TIM13_IRQn)
IRQN_HANDLER(45, TIM14_IRQn)
SKIP_HANLDER(46)
SKIP_HANLDER(47)
SKIP_HANLDER(48)
SKIP_HANLDER(49)
IRQN_HANDLER(50, TIM5_IRQn)
IRQN_HANDLER(51, SPI3_IRQn)
IRQN_HANDLER(52, UART4_IRQn)
IRQN_HANDLER(53, UART5_IRQn)
IRQN_HANDLER(54, TIM6_DAC_IRQn)
IRQN_HANDLER(55, TIM7_IRQn)
IRQN_HANDLER(56, DMA2_Channel1_IRQn)
IRQN_HANDLER(57, DMA2_Channel2_IRQn)
IRQN_HANDLER(58, DMA2_Channel3_IRQn)
IRQN_HANDLER(59, DMA2_Channel4 59 DMA2_Channel4_5_IRQn)
IRQN_HANDLER(60, DMA2_Channel5_IRQn)

#endif

